#include <bits/stdc++.h>
using namespace std;

bool cmp(int a, int b) {
	return (a < b ? true : false);
};

set<int, decltype(&cmp)> s(cmp);
//set의 경우 true일때 
// a ,b 순으로 정렬된다.

priority_queue<int, vector<int>, decltype(&cmp)> q(cmp);
//priority_queue의 경우 true일때 
// b가 우선순위가 높다.

int main() {
	//-------------------------------------------------------------
	//set 입력 및 출력
	//-------------------------------------------------------------
	s.insert(4); s.insert(6); s.insert(5); s.insert(1); s.insert(3); s.insert(2);
	for (int t : s)cout << t << " ";
	cout << '\n';
	//-------------------------------------------------------------	
	// 결과 : 1 2 3 4 5 6
	//-------------------------------------------------------------




	//-------------------------------------------------------------
	//priority_queue 입력 및 출력
	//-------------------------------------------------------------
	q.push(4);	q.push(6);	q.push(5); q.push(1); q.push(3); q.push(2);
	while (!q.empty()) {
		int t = q.top(); q.pop();
		cout << t << " ";
	}
	//-------------------------------------------------------------
	// 결과 : 6 5 4 3 2 1
	//-------------------------------------------------------------

	return 0;
}